src/cf/InformationRegisters/ReportMailingStates.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ReportMailingStates</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>LastRunStart</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>LastRunCompletion</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>SuccessfulStart</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Executed</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>WithErrors</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>SessionNumber</Name>
					<Comment>Used for selecting the log based on the number of the report distribution session. For more information, see The number of the information database session in the syntax assistant.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>25</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>BulkEmail</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ReportMailings</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ReportMailingStates/Ext/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// 
//  
// 
// 
// 
///////////////////////////////////////////////////////////////////////////////////////////////////////

#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Private

// For internal use.
// 
Procedure FixMailingStart(BulkEmail) Export
	SetPrivilegedMode(True);
	
	BeginTransaction();
	Try
		Block = New DataLock();
		LockItem = Block.Add("InformationRegister.ReportMailingStates");
		LockItem.SetValue("BulkEmail", BulkEmail);
		Block.Lock();
		
		RecordManager = CreateRecordManager();
		RecordManager.BulkEmail = BulkEmail;
		RecordManager.Read();
		
		RecordManager.BulkEmail = BulkEmail;
		RecordManager.LastRunStart = CurrentSessionDate();
		// 
		RecordManager.LastRunCompletion = RecordManager.LastRunStart + 30 * 60; 
		RecordManager.SessionNumber = InfoBaseSessionNumber();
		RecordManager.Executed = False;
		RecordManager.WithErrors = True;
		
		RecordManager.Write(True);
		
		CommitTransaction();
	Except
		RollbackTransaction();
		Raise;
	EndTry;
EndProcedure

// For internal use.
// 
Procedure FixMailingExecutionResult(BulkEmail, ExecutionResult) Export
	SetPrivilegedMode(True);
	
	BeginTransaction();
	Try
		Block = New DataLock();
		LockItem = Block.Add("InformationRegister.ReportMailingStates");
		LockItem.SetValue("BulkEmail", BulkEmail);
		Block.Lock();
		
		RecordManager = CreateRecordManager();
		RecordManager.BulkEmail = BulkEmail;
		RecordManager.Read();
		
		RecordManager.BulkEmail = BulkEmail;
		RecordManager.WithErrors = ExecutionResult.HadErrors;
		RecordManager.Executed = ExecutionResult.ExecutedToFolder
			Or ExecutionResult.ExecutedToNetworkDirectory
			Or ExecutionResult.ExecutedAtFTP
			Or ExecutionResult.ExecutedByEmail
			Or Not RecordManager.WithErrors;
		If RecordManager.Executed Then
			RecordManager.SuccessfulStart = RecordManager.LastRunStart;
		EndIf;
		RecordManager.LastRunCompletion = CurrentSessionDate();
		
		RecordManager.Write(True);
		CommitTransaction();
	Except
		RollbackTransaction();
		Raise;
	EndTry;
EndProcedure

#EndRegion

#EndIf
